danielhood/valhalla/stm32-src/shrine-rfid-reader/Core/Inc/driver_mfrc522_interface.h
/**
 * Copyright (c) 2015 - present LibDriver All rights reserved
 * 
 * The MIT License (MIT)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE. 
 *
 * @file      driver_mfrc522_interface.h
 * @brief     driver mfrc522 interface header file
 * @version   1.0.0
 * @author    Shifeng Li
 * @date      2022-05-31
 *
 * <h3>history</h3>
 * <table>
 * <tr><th>Date        <th>Version  <th>Author      <th>Description
 * <tr><td>2022/05/31  <td>1.0      <td>Shifeng Li  <td>first upload
 * </table>
 */

#ifndef DRIVER_MFRC522_INTERFACE_H
#define DRIVER_MFRC522_INTERFACE_H

#include "driver_mfrc522.h"
#include "stm32l4xx_hal.h"

#ifdef __cplusplus
extern "C"{
#endif

#define NO_DEBUG

#define MFRC522_INTERFACE_MAX_DEVICES 4U

/* Bound USART2 TX (ST-Link virtual COM): avoid HAL_MAX_DELAY so debug prints cannot wedge the MCU
 * when USB is charger-only / no host enumerates — I2C and RFID SPI must stay schedulable. */
#ifndef MAIN_DEBUG_UART_TX_TIMEOUT_MS
#define MAIN_DEBUG_UART_TX_TIMEOUT_MS 150U
#endif


/**
 * @defgroup mfrc522_interface_driver mfrc522 interface driver function
 * @brief    mfrc522 interface driver modules
 * @ingroup  mfrc522_driver
 * @{
 */

/**
 * @brief  interface reset gpio init
 * @return status code
 *         - 0 success
 *         - 1 reset gpio init failed
 * @note   none
 */
uint8_t mfrc522_interface_reset_gpio_init(void);

/**
 * @brief  interface reset gpio deinit
 * @return status code
 *         - 0 success
 *         - 1 reset gpio deinit failed
 * @note   none
 */
uint8_t mfrc522_interface_reset_gpio_deinit(void);

/**
 * @brief     interface reset gpio write
 * @param[in] value written value
 * @return    status code
 *            - 0 success
 *            - 1 reset gpio write failed
 * @note      none
 */
uint8_t mfrc522_interface_reset_gpio_write(uint8_t value);

/**
 * @brief  interface iic bus init
 * @return status code
 *         - 0 success
 *         - 1 iic init failed
 * @note   none
 */
uint8_t mfrc522_interface_iic_init(void);

/**
 * @brief  interface iic bus deinit
 * @return status code
 *         - 0 success
 *         - 1 iic deinit failed
 * @note   none
 */
uint8_t mfrc522_interface_iic_deinit(void);

/**
 * @brief      interface iic bus read
 * @param[in]  addr iic device write address
 * @param[in]  reg iic register address
 * @param[out] *buf pointer to a data buffer
 * @param[in]  len length of the data buffer
 * @return     status code
 *             - 0 success
 *             - 1 read failed
 * @note       none
 */
uint8_t mfrc522_interface_iic_read(uint8_t addr, uint8_t reg, uint8_t *buf, uint16_t len);

/**
 * @brief     interface iic bus write
 * @param[in] addr iic device write address
 * @param[in] reg iic register address
 * @param[in] *buf pointer to a data buffer
 * @param[in] len length of the data buffer
 * @return    status code
 *            - 0 success
 *            - 1 write failed
 * @note      none
 */
uint8_t mfrc522_interface_iic_write(uint8_t addr, uint8_t reg, uint8_t *buf, uint16_t len);

/**
 * @brief  interface spi bus init
 * @return status code
 *         - 0 success
 *         - 1 spi init failed
 * @note   none
 */
uint8_t mfrc522_interface_spi_init(void);

/**
 * @brief  interface spi bus deinit
 * @return status code
 *         - 0 success
 *         - 1 spi deinit failed
 * @note   none
 */
uint8_t mfrc522_interface_spi_deinit(void);

/**
 * @brief      interface spi bus read
 * @param[in]  reg register address
 * @param[out] *buf pointer to a data buffer
 * @param[in]  len length of data buffer
 * @return     status code
 *             - 0 success
 *             - 1 read failed
 * @note       none
 */
uint8_t mfrc522_interface_spi_read(uint8_t reg, uint8_t *buf, uint16_t len);

/**
 * @brief     interface spi bus write
 * @param[in] reg register address
 * @param[in] *buf pointer to a data buffer
 * @param[in] len length of data buffer
 * @return    status code
 *            - 0 success
 *            - 1 write failed
 * @note      none
 */
uint8_t mfrc522_interface_spi_write(uint8_t reg, uint8_t *buf, uint16_t len);

/**
 * @brief     register an SPI chip-select pin for a logical MFRC522 device slot
 * @param[in] index logical device index [0..MFRC522_INTERFACE_MAX_DEVICES-1]
 * @param[in] cs_port gpio port for CS
 * @param[in] cs_pin gpio pin for CS
 * @return    status code
 *            - 0 success
 *            - 1 invalid argument
 * @note      CS is driven high after registration
 */
uint8_t mfrc522_interface_spi_register_device(uint8_t index, GPIO_TypeDef *cs_port, uint16_t cs_pin);

/**
 * @brief     select active logical MFRC522 SPI device
 * @param[in] index logical device index [0..MFRC522_INTERFACE_MAX_DEVICES-1]
 * @return    status code
 *            - 0 success
 *            - 1 invalid index or device not registered
 * @note      SPI read/write functions use this active selection
 */
uint8_t mfrc522_interface_spi_select_device(uint8_t index);

/**
 * @brief  clear active SPI device selection
 * @note   subsequent SPI read/write will fail until device is selected
 */
void mfrc522_interface_spi_select_none(void);

/**
 * @brief  interface uart init
 * @return status code
 *         - 0 success
 *         - 1 uart init failed
 * @note   none
 */
uint8_t mfrc522_interface_uart_init(void);

/**
 * @brief  interface uart deinit
 * @return status code
 *         - 0 success
 *         - 1 uart deinit failed
 * @note   none
 */
uint8_t mfrc522_interface_uart_deinit(void);

/**
 * @brief      interface uart read
 * @param[out] *buf pointer to a data buffer
 * @param[in]  len length of the data buffer
 * @return     status code
 *             - 0 success
 *             - 1 read failed
 * @note       none
 */
uint16_t mfrc522_interface_uart_read(uint8_t *buf, uint16_t len);

/**
 * @brief     interface uart write
 * @param[in] *buf pointer to a data buffer
 * @param[in] len length of the data buffer
 * @return    status code
 *            - 0 success
 *            - 1 write failed
 * @note      none
 */
uint8_t mfrc522_interface_uart_write(uint8_t *buf, uint16_t len);

/**
 * @brief  interface uart flush
 * @return status code
 *         - 0 success
 *         - 1 uart flush failed
 * @note   none
 */
uint8_t mfrc522_interface_uart_flush(void);

/**
 * @brief     interface delay ms
 * @param[in] ms time
 * @note      none
 */
void mfrc522_interface_delay_ms(uint32_t ms);

/**
 * @brief     interface print format data
 * @param[in] fmt format data
 * @note      none
 */
void mfrc522_interface_debug_print(const char *const fmt, ...);

/**
 * @brief     print buffer bytes in hex via debug print
 * @param[in] buf buffer to print
 * @param[in] len number of bytes
 * @note      none
 */
void mfrc522_interface_debug_print_hex(const uint8_t *buf, uint16_t len);

/**
 * @brief     interface receive callback
 * @param[in] type irq type
 * @note      none
 */
void mfrc522_interface_receive_callback(uint16_t type);

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif
